%Исходные данные:
%М - математическое ожидание
%D - дисперсия
%P - вероятность
M12 = 12; D12 = 9 ; P12 = 0.5;
M14 = 28; D14 = 16; P14 = 0.5;
M25 = 14; D25 = 9 ; P25 = 1  ;
M31 = 11; D31 = 4 ; P31 = 0.6;
M33 = 33; D33 = 16; P33 = 0.4;
M42 = 11; D42 = 4 ; P42 = 0.1;
M43 = 33; D43 = 25; P43 = 0.3;
M45 = 45; D45 = 25; P45 = 0.2;
M46 = 23; D46 = 16; P46 = 0.4;
M56 = 43; D56 = 25; P56 = 1  ;

syms s;
%W - функции
W12 = P12 * exp(M12 * s + D12/2 * s^2);
W14 = P14 * exp(M14 * s + D14/2 * s^2);
W25 = P25 * exp(M25 * s + D25/2 * s^2);
W31 = P31 * exp(M31 * s + D31/2 * s^2);
W33 = P33 * exp(M33 * s + D33/2 * s^2);
W42 = P42 * exp(M42 * s + D42/2 * s^2);
W43 = P43 * exp(M43 * s + D43/2 * s^2);
W45 = P45 * exp(M45 * s + D45/2 * s^2);
W46 = P46 * exp(M46 * s + D46/2 * s^2);
W56 = P56 * exp(M56 * s + D56/2 * s^2);

WE = (W12*W25*W56 + W14*W42*W25*W56 + W14*W45*W56 + W14*W46 - W33*W12*W25*W56 - W33*W14*W42*W25*W56 - W33*W14*W45*W56 - W33*W14*W46)/(1 - W14*W43*W31 - W33)

We = simplify(WE)
We0 = subs(We, 's', 0)  % We(0)

% Нахождение мат. ожидания и дисперсии
Me = We / We0;

% Нахождение производной 1-го порядка при s = 0
m1 = diff(Me, 's');
% Замена символа s на 0 в выражении m1
m1 = subs(m1, 's', 0)

% Нахождение производной 2-го порядка при s = 0
m2 = diff(Me, 's', 2);
% Замена символа s на 0 в выражении m2
m2=subs(m2, 's', 0)

% Нахождение дисперсии времени выхода процесса в завершающий узел графа
D = m2 - (m1)^2
