clc; clearvars

f1 = @(X) 3*X(1)+2*X(2);
f2 = @(X) 5.5*X(3) + 3*X(4);
f3 = @(X) 6 - X(1) - 2*X(2) - X(3) - 2*X(4) ;

z1 = @(N) -f1(N); 
z2 = @(N) -f2(N); 

% Функциональные ограичения 
A = [1,2,1,2;
    2,1,2,1;
    1,-1,1,- 1;
    1.8 , 1.2 , -2.2 , -1.2];
b = [6; 8; 4; 0];

% Параметрические ограничения
lb = [0; 0; 0; 0];

% Поиск оптимумов частных критериев
[x_1, z1_opt] = fmincon(z1, lb, A, b, [], [], lb);
[x_2, z2_opt] = fmincon(z2, lb, A, b, [], [], lb);
[x_3, f3_opt] = fmincon(f3, lb, A, b, [], [], lb);

f = @(N) (1-z1(N)/z1_opt)^2+(1-z2(N)/z2_opt)^2+(1-f3(N)/f3_opt)^2;
[N, f_opt] = fmincon(f, lb, A, b, [], [], lb, [],[],optimset('Display','iter'))