clc; clearvars

f1 = @(X) 3*X(1)+2*X(2);
f2 = @(X) 5.5*X(3) + 3*X(4);
f3 = @(X) 6 - X(1) - 2*X(2) - X(3) - 2*X(4) ;

z1 = @(N) -f1(N); 
z2 = @(N) -f2(N); 

% Функциональные ограичения 
A = [1,2,1,2;
    2,1,2,1;
    1,-1,1,- 1;
    1.8 , 1.2 , -2.2 , -1.2;
    -3,-2,0,0;
    -1,-2,-1,-2];
b = [6; 8; 4; 0; -5; 5.999];

% Параметрические ограничения
lb = [0; 0; 0; 0];


f = @(N) ((f1(N)/6.9667)^0.3)*((f2(N)/22.333)^0.3)*((f3(N)/0.00002)^0.4)

[N, f_opt] = fmincon(f, lb, A, b, [], [], lb,[], [],optimset('Display','iter'))

f1(N)
f2(N)
f3(N)
