function tim_1
clc; clearvars

f1 = @(X) 0.8*X(1)+2*X(2)+5*X(3)+4*X(4)+6*X(5)+5*X(6); %->max
z1 = @(N) -f1(N); 
sum = 0;


A = [0.3,1,1,1,1,0.5;
    -0.9,-8,0,0,-2,0];
b = [100; -50];

lb = [0;   0; 3;   2;   0; 0];
ub = [100; 3; 100; 100; 5; 100];

function [ctmp,ceqtmp] = f3(X)
    ceqtmp = [];
if (0.3*X(1)+X(2)+X(3)+X(4)+X(5)+0.5*X(6)) <= 25
ctmp = -5000+(50*X(1)+30*X(2)+30*X(3)+50*X(4)+70*X(5)+20*X(6)); %->min
else
ctmp = -5000+(50*X(1)+30*X(2)+30*X(3)+50*X(4)+70*X(5)+20*X(6) +100*(0.3*X(1)+0.5*X(6)+X(2)+X(3)+X(4)+X(5)-25)); %->min
end
sum= ctmp+5000;
end

[x_1, z1_opt] = fmincon(z1, lb, A, b, [], [], lb,ub, @f3);

fprintf('Эффект + вкус максимизирован\n');
fprintf('x1 = %.4f (шампанское)\nx2 = %.4f (водка)\nx3 = %.4f (сок)\nx4 = %.4f (коктейль)\nx5 = %.4f (коньяк)\nx6 = %.4f (салат)\n' , x_1 );
fprintf('f1 = %.4f\n\n', -z1_opt);
fprintf('Стоимость = %.4f\n\n', sum );
fprintf('Вес = %.4f\n\n', 0.3*x_1(1)+1*x_1(2)+1*x_1(3)+1*x_1(4)+1*x_1(5)+0.5*x_1(6));
end

