clc; clearvars
%Исходные данные
%М - математическое ожидание
%D - дисперсия
%P - вероятность
P12 = 1; M12 = 23; D12 = 16; 
P22 = 0.2; M22 = 28; D22 = 36; 
P23 = 0.7; M23 = 25; D23 = 16; 
P25 = 0.1; M25 = 43; D25 = 25; 
P31 = 0.5; M31 = 12; D31 = 4; 
P34 = 0.5; M34 = 43; D34 = 9; 
P41 = 0.6; M41 = 20; D41 = 9; 
P46 = 0.4; M46 = 27; D46 = 25; 
P53 = 0.5; M53 = 35; D53 = 36;
P56 = 0.5; M56 = 19; D56 = 16; 
 
syms s
%W - функции
W12 = P12*exp(M12*s+D12/2*s^2);
W22 = P22*exp(M22*s+D22/2*s^2);
W23 = P23*exp(M23*s+D23/2*s^2);
W25 = P25*exp(M25*s+D25/2*s^2);
W31 = P31*exp(M31*s+D31/2*s^2);
W34 = P34*exp(M34*s+D34/2*s^2);
W41 = P41*exp(M41*s+D41/2*s^2);
W46 = P46*exp(M46*s+D46/2*s^2);
W53 = P53*exp(M53*s+D53/2*s^2);
W56 = P56*exp(M56*s+D56/2*s^2);
 
We = (W12*W23*W34*W46+W12*W25*W53*W34*W46+W12*W25*W56)/(1 - W12*W23*W31-W12*W23*W34*W41-W12*W25*W53*W31-W12*W25*W53*W34*W41-W22);
 
We = simplify(We)
We0 = subs(We, 's', 0)  % We(0)
 
% Нахождение мат. ожидания и дисперсии
Me = We/We0;
 
% Нахождение производной 1-го порядка при s=0
m1 = diff(Me, 's');     
m1 = subs(m1, 's', 0)   % Замена символа s на 0 в выражении m1
 
% Нахождение производной 2-го порядка при s=0
m2 = diff(Me, 's',2);
m2=subs(m2, 's', 0)     % Замена символа s на 0 в выражении m2
 
% Нахождение дисперсии времени выхода процесса в завершающий узел графа
D = m2 - (m1)^2