clc; clearvars
%Исходные данные
%М - математическое ожидание
%D - дисперсия
%P - вероятность
P12 = 1; M12 = 20; D12 = 9; 
P22 = 0.6; M22 = 30; D22 = 16; 
P23 = 0.4; M23 = 40; D23 = 25; 
P32 = 0.5; M32 = 28; D32 = 16; 
P34 = 0.5; M34 = 37; D34 = 16; 
P45 = 1; M45 = 30; D45 = 25; 
P51 = 0.2; M51 = 30; D51 = 16; 
P55 = 0.1; M55 = 10; D55 = 4; 
P56 = 0.7; M56 = 30; D56 = 16; 
 
syms s
%W - функции
W12 = P12*exp(M12*s+D12/2*s^2);
W22 = P22*exp(M22*s+D22/2*s^2);
W23 = P23*exp(M23*s+D23/2*s^2);
W32 = P32*exp(M32*s+D32/2*s^2);
W34 = P34*exp(M34*s+D34/2*s^2);
W45 = P45*exp(M45*s+D45/2*s^2);
W51 = P51*exp(M51*s+D51/2*s^2);
W55 = P55*exp(M55*s+D55/2*s^2);
W56 = P56*exp(M56*s+D56/2*s^2);
 
We = (W12*W23*W34*W45*W56)/(1 - W12*W23*W34*W45*W51-W22-W23*W32-W55+W22*W55+W55*W23*W32);
 
We = simplify(We)
We0 = subs(We, 's', 0)  % We(0)
 
% Нахождение мат. ожидания и дисперсии
Me = We/We0;
 
% Нахождение производной 1-го порядка при s=0
m1 = diff(Me, 's');     
m1 = subs(m1, 's', 0)   % Замена символа s на 0 в выражении m1
 
% Нахождение производной 2-го порядка при s=0
m2 = diff(Me, 's',2);
m2=subs(m2, 's', 0)     % Замена символа s на 0 в выражении m2
 
% Нахождение дисперсии времени выхода процесса в завершающий узел графа
D = m2 - (m1)^2