clc; clearvars

f = @(X) 5.5*X(3) + 3*X(4);

f1 = @(X) 3*X(1)+2*X(2);
f2 = @(X) 5.5*X(3) + 3*X(4);
f3 = @(X) 6 - X(1) - 2*X(2) - X(3) - 2*X(4) ;

z1 = @(N) -f1(N); 
z2 = @(N) -f2(N); 
z = @(N) -f(N); 

% Функциональные ограичения 
A = [1,2,1,2;
    2,1,2,1;
    1,-1,1,- 1;
    1.8 , 1.2 , -2.2 , -1.2;
    -3,-2,0,0;
    -1,-2,-1,-2];
b = [6; 8; 4; 0; -5; 6-0.0000004];

% Поиск оптимумов частных критериев
[x, opt] = fmincon(z, [0; 0; 0; 0], A, b, [], [], [0; 0; 0; 0],[], [],optimset('Display','iter'))
    f1(x)
    f2(x)
    f3(x)
    