x0=[1;
    1;
    1;
    1];

A=[5 1 9 12; 
   2 3 4 1; 
   3 2 5 1;
   -1 0 0 0; 
   0 -1 0 0; 
   0 0 -1 0;
   0 0 0 -1];

b = [1500, 1000, 800, 0, 0, 0, 0];
 
%Первый критерий
clc
clear
 
% Исходные данные
x0=[0;
    0;
    0;
    0];
 
A=[5 1 9 12; 
   2 3 4 1; 
   3 2 5 1;
   -1 0 0 0; 
   0 -1 0 0; 
   0 0 -1 0;
   0 0 0 -1];
 
b = [1500, 1000, 800, 0, 0, 0, 0];
 
[x1, f1] = fmincon(inline('-12*x(1)-5*x(2)-15*x(3)-10*x(4)'), x0, A, b)
 
[x2, f2] = fmincon(inline('-32*x(1)-15*x(2)-12*x(3)-80*x(4)'), x0, A, b)
 
goal = [0 0];
goal(1) = f1;
goal(2) = f2;
 
weight = abs(goal);
 
[x, f3, attainfactor] = fgoalattain(@myfun, x0, goal, weight, A, b)

